Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_tamp.h
/*
; stm32V873_tamp.
; ===============

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32V873_tamp equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// TAMP address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    CR1;
    volatile    uint32_t    CR2;
    volatile    uint32_t    CR3;
    volatile    uint32_t    FLTCR;
    volatile    uint32_t    ATCR1;
    volatile    uint32_t    ATSEEDR;
    volatile    uint32_t    ATOR;
    volatile    uint32_t    ATCR2;
    volatile    uint32_t    SECCFGR;
    volatile    uint32_t    PRIVCFGR;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    IER;
    volatile    uint32_t    SR;
    volatile    uint32_t    MISR;
    volatile    uint32_t    SMISR;
    volatile    uint32_t    SCR;
    volatile    uint32_t    COUNT1R;
    volatile    uint32_t    RESERVED1[4];
    volatile    uint32_t    RPCFGR;
    volatile    uint32_t    RESERVED2[42];
    volatile    uint32_t    BKP0R;
    volatile    uint32_t    BKP1R;
    volatile    uint32_t    BKP2R;
    volatile    uint32_t    BKP3R;
    volatile    uint32_t    BKP4R;
    volatile    uint32_t    BKP5R;
    volatile    uint32_t    BKP6R;
    volatile    uint32_t    BKP7R;
    volatile    uint32_t    BKP8R;
    volatile    uint32_t    BKP9R;
    volatile    uint32_t    BKP10R;
    volatile    uint32_t    BKP11R;
    volatile    uint32_t    BKP12R;
    volatile    uint32_t    BKP13R;
    volatile    uint32_t    BKP14R;
    volatile    uint32_t    BKP15R;
    volatile    uint32_t    BKP16R;
    volatile    uint32_t    BKP17R;
    volatile    uint32_t    BKP18R;
    volatile    uint32_t    BKP19R;
    volatile    uint32_t    BKP20R;
    volatile    uint32_t    BKP21R;
    volatile    uint32_t    BKP22R;
    volatile    uint32_t    BKP23R;
    volatile    uint32_t    BKP24R;
    volatile    uint32_t    BKP25R;
    volatile    uint32_t    BKP26R;
    volatile    uint32_t    BKP27R;
    volatile    uint32_t    BKP28R;
    volatile    uint32_t    BKP29R;
    volatile    uint32_t    BKP30R;
    volatile    uint32_t    BKP31R;
} TAMP_TypeDef;

#if (defined(__cplusplus))
#define TAMP_NS     reinterpret_cast<TAMP_TypeDef *>(0x46004400u)
#define TAMP_S      reinterpret_cast<TAMP_TypeDef *>(0x56004400u)

#else
#define TAMP_NS     ((TAMP_TypeDef *)0x46004400u)
#define TAMP_S      ((TAMP_TypeDef *)0x56004400u)
#endif

// CR1 Configuration

#define TAMP_CR1_ITAMP15E               (0x1u<<30)
#define TAMP_CR1_ITAMP13E               (0x1u<<28)
#define TAMP_CR1_ITAMP12E               (0x1u<<27)
#define TAMP_CR1_ITAMP11E               (0x1u<<26)
#define TAMP_CR1_ITAMP9E                (0x1u<<24)
#define TAMP_CR1_ITAMP8E                (0x1u<<23)
#define TAMP_CR1_ITAMP7E                (0x1u<<22)
#define TAMP_CR1_ITAMP6E                (0x1u<<21)
#define TAMP_CR1_ITAMP5E                (0x1u<<20)
#define TAMP_CR1_ITAMP4E                (0x1u<<19)
#define TAMP_CR1_ITAMP3E                (0x1u<<18)
#define TAMP_CR1_ITAMP2E                (0x1u<<17)
#define TAMP_CR1_ITAMP1E                (0x1u<<16)
#define TAMP_CR1_TAMP8E                 (0x1u<<7)
#define TAMP_CR1_TAMP7E                 (0x1u<<6)
#define TAMP_CR1_TAMP6E                 (0x1u<<5)
#define TAMP_CR1_TAMP5E                 (0x1u<<4)
#define TAMP_CR1_TAMP4E                 (0x1u<<3)
#define TAMP_CR1_TAMP3E                 (0x1u<<2)
#define TAMP_CR1_TAMP2E                 (0x1u<<1)
#define TAMP_CR1_TAMP1E                 (0x1u<<0)

#define TAMP_CR1_ITAMP15E_B_0X0         (0x0u<<30)
#define TAMP_CR1_ITAMP15E_B_0X1         (0x1u<<30)
#define TAMP_CR1_ITAMP13E_B_0X0         (0x0u<<28)
#define TAMP_CR1_ITAMP13E_B_0X1         (0x1u<<28)
#define TAMP_CR1_ITAMP12E_B_0X0         (0x0u<<27)
#define TAMP_CR1_ITAMP12E_B_0X1         (0x1u<<27)
#define TAMP_CR1_ITAMP11E_B_0X0         (0x0u<<26)
#define TAMP_CR1_ITAMP11E_B_0X1         (0x1u<<26)
#define TAMP_CR1_ITAMP9E_B_0X0          (0x0u<<24)
#define TAMP_CR1_ITAMP9E_B_0X1          (0x1u<<24)
#define TAMP_CR1_ITAMP8E_B_0X0          (0x0u<<23)
#define TAMP_CR1_ITAMP8E_B_0X1          (0x1u<<23)
#define TAMP_CR1_ITAMP7E_B_0X0          (0x0u<<22)
#define TAMP_CR1_ITAMP7E_B_0X1          (0x1u<<22)
#define TAMP_CR1_ITAMP6E_B_0X0          (0x0u<<21)
#define TAMP_CR1_ITAMP6E_B_0X1          (0x1u<<21)
#define TAMP_CR1_ITAMP5E_B_0X0          (0x0u<<20)
#define TAMP_CR1_ITAMP5E_B_0X1          (0x1u<<20)
#define TAMP_CR1_ITAMP4E_B_0X0          (0x0u<<19)
#define TAMP_CR1_ITAMP4E_B_0X1          (0x1u<<19)
#define TAMP_CR1_ITAMP3E_B_0X0          (0x0u<<18)
#define TAMP_CR1_ITAMP3E_B_0X1          (0x1u<<18)
#define TAMP_CR1_ITAMP2E_B_0X0          (0x0u<<17)
#define TAMP_CR1_ITAMP2E_B_0X1          (0x1u<<17)
#define TAMP_CR1_ITAMP1E_B_0X0          (0x0u<<16)
#define TAMP_CR1_ITAMP1E_B_0X1          (0x1u<<16)
#define TAMP_CR1_TAMP8E_B_0X0           (0x0u<<7)
#define TAMP_CR1_TAMP8E_B_0X1           (0x1u<<7)
#define TAMP_CR1_TAMP7E_B_0X0           (0x0u<<6)
#define TAMP_CR1_TAMP7E_B_0X1           (0x1u<<6)
#define TAMP_CR1_TAMP6E_B_0X0           (0x0u<<5)
#define TAMP_CR1_TAMP6E_B_0X1           (0x1u<<5)
#define TAMP_CR1_TAMP5E_B_0X0           (0x0u<<4)
#define TAMP_CR1_TAMP5E_B_0X1           (0x1u<<4)
#define TAMP_CR1_TAMP4E_B_0X0           (0x0u<<3)
#define TAMP_CR1_TAMP4E_B_0X1           (0x1u<<3)
#define TAMP_CR1_TAMP3E_B_0X0           (0x0u<<2)
#define TAMP_CR1_TAMP3E_B_0X1           (0x1u<<2)
#define TAMP_CR1_TAMP2E_B_0X0           (0x0u<<1)
#define TAMP_CR1_TAMP2E_B_0X1           (0x1u<<1)
#define TAMP_CR1_TAMP1E_B_0X0           (0x0u<<0)
#define TAMP_CR1_TAMP1E_B_0X1           (0x1u<<0)

// CR2 Configuration

#define TAMP_CR2_TAMP8TRG               (0x1u<<31)
#define TAMP_CR2_TAMP7TRG               (0x1u<<30)
#define TAMP_CR2_TAMP6TRG               (0x1u<<29)
#define TAMP_CR2_TAMP5TRG               (0x1u<<28)
#define TAMP_CR2_TAMP4TRG               (0x1u<<27)
#define TAMP_CR2_TAMP3TRG               (0x1u<<26)
#define TAMP_CR2_TAMP2TRG               (0x1u<<25)
#define TAMP_CR2_TAMP1TRG               (0x1u<<24)
#define TAMP_CR2_BKERASE                (0x1u<<23)
#define TAMP_CR2_BKBLOCK                (0x1u<<22)
#define TAMP_CR2_TAMP3MSK               (0x1u<<18)
#define TAMP_CR2_TAMP2MSK               (0x1u<<17)
#define TAMP_CR2_TAMP1MSK               (0x1u<<16)
#define TAMP_CR2_TAMP8POM               (0x1u<<7)
#define TAMP_CR2_TAMP7POM               (0x1u<<6)
#define TAMP_CR2_TAMP6POM               (0x1u<<5)
#define TAMP_CR2_TAMP5POM               (0x1u<<4)
#define TAMP_CR2_TAMP4POM               (0x1u<<3)
#define TAMP_CR2_TAMP3POM               (0x1u<<2)
#define TAMP_CR2_TAMP2POM               (0x1u<<1)
#define TAMP_CR2_TAMP1POM               (0x1u<<0)

#define TAMP_CR2_TAMP8TRG_B_0X0         (0x0u<<31)
#define TAMP_CR2_TAMP8TRG_B_0X1         (0x1u<<31)
#define TAMP_CR2_TAMP7TRG_B_0X0         (0x0u<<30)
#define TAMP_CR2_TAMP7TRG_B_0X1         (0x1u<<30)
#define TAMP_CR2_TAMP6TRG_B_0X0         (0x0u<<29)
#define TAMP_CR2_TAMP6TRG_B_0X1         (0x1u<<29)
#define TAMP_CR2_TAMP5TRG_B_0X0         (0x0u<<28)
#define TAMP_CR2_TAMP5TRG_B_0X1         (0x1u<<28)
#define TAMP_CR2_TAMP4TRG_B_0X0         (0x0u<<27)
#define TAMP_CR2_TAMP4TRG_B_0X1         (0x1u<<27)
#define TAMP_CR2_TAMP3TRG_B_0X0         (0x0u<<26)
#define TAMP_CR2_TAMP3TRG_B_0X1         (0x1u<<26)
#define TAMP_CR2_TAMP2TRG_B_0X0         (0x0u<<25)
#define TAMP_CR2_TAMP2TRG_B_0X1         (0x1u<<25)
#define TAMP_CR2_TAMP1TRG_B_0X0         (0x0u<<24)
#define TAMP_CR2_TAMP1TRG_B_0X1         (0x1u<<24)
#define TAMP_CR2_BKBLOCK_B_0X0          (0x0u<<22)
#define TAMP_CR2_BKBLOCK_B_0X1          (0x1u<<22)
#define TAMP_CR2_TAMP3MSK_B_0X0         (0x0u<<18)
#define TAMP_CR2_TAMP3MSK_B_0X1         (0x1u<<18)
#define TAMP_CR2_TAMP2MSK_B_0X0         (0x0u<<17)
#define TAMP_CR2_TAMP2MSK_B_0X1         (0x1u<<17)
#define TAMP_CR2_TAMP1MSK_B_0X0         (0x0u<<16)
#define TAMP_CR2_TAMP1MSK_B_0X1         (0x1u<<16)
#define TAMP_CR2_TAMP8POM_B_0X0         (0x0u<<7)
#define TAMP_CR2_TAMP8POM_B_0X1         (0x1u<<7)
#define TAMP_CR2_TAMP7POM_B_0X0         (0x0u<<6)
#define TAMP_CR2_TAMP7POM_B_0X1         (0x1u<<6)
#define TAMP_CR2_TAMP6POM_B_0X0         (0x0u<<5)
#define TAMP_CR2_TAMP6POM_B_0X1         (0x1u<<5)
#define TAMP_CR2_TAMP5POM_B_0X0         (0x0u<<4)
#define TAMP_CR2_TAMP5POM_B_0X1         (0x1u<<4)
#define TAMP_CR2_TAMP4POM_B_0X0         (0x0u<<3)
#define TAMP_CR2_TAMP4POM_B_0X1         (0x1u<<3)
#define TAMP_CR2_TAMP3POM_B_0X0         (0x0u<<2)
#define TAMP_CR2_TAMP3POM_B_0X1         (0x1u<<2)
#define TAMP_CR2_TAMP2POM_B_0X0         (0x0u<<1)
#define TAMP_CR2_TAMP2POM_B_0X1         (0x1u<<1)
#define TAMP_CR2_TAMP1POM_B_0X0         (0x0u<<0)
#define TAMP_CR2_TAMP1POM_B_0X1         (0x1u<<0)

// CR3 Configuration

#define TAMP_CR3_ITAMP15POM             (0x1u<<14)
#define TAMP_CR3_ITAMP13POM             (0x1u<<12)
#define TAMP_CR3_ITAMP12POM             (0x1u<<11)
#define TAMP_CR3_ITAMP11POM             (0x1u<<10)
#define TAMP_CR3_ITAMP9POM              (0x1u<<8)
#define TAMP_CR3_ITAMP8POM              (0x1u<<7)
#define TAMP_CR3_ITAMP7POM              (0x1u<<6)
#define TAMP_CR3_ITAMP6POM              (0x1u<<5)
#define TAMP_CR3_ITAMP5POM              (0x1u<<4)
#define TAMP_CR3_ITAMP4POM              (0x1u<<3)
#define TAMP_CR3_ITAMP3POM              (0x1u<<2)
#define TAMP_CR3_ITAMP2POM              (0x1u<<1)
#define TAMP_CR3_ITAMP1POM              (0x1u<<0)

#define TAMP_CR3_ITAMP15POM_B_0X0       (0x0u<<14)
#define TAMP_CR3_ITAMP15POM_B_0X1       (0x1u<<14)
#define TAMP_CR3_ITAMP13POM_B_0X0       (0x0u<<12)
#define TAMP_CR3_ITAMP13POM_B_0X1       (0x1u<<12)
#define TAMP_CR3_ITAMP12POM_B_0X0       (0x0u<<11)
#define TAMP_CR3_ITAMP12POM_B_0X1       (0x1u<<11)
#define TAMP_CR3_ITAMP11POM_B_0X0       (0x0u<<10)
#define TAMP_CR3_ITAMP11POM_B_0X1       (0x1u<<10)
#define TAMP_CR3_ITAMP9POM_B_0X0        (0x0u<<8)
#define TAMP_CR3_ITAMP9POM_B_0X1        (0x1u<<8)
#define TAMP_CR3_ITAMP8POM_B_0X0        (0x0u<<7)
#define TAMP_CR3_ITAMP8POM_B_0X1        (0x1u<<7)
#define TAMP_CR3_ITAMP7POM_B_0X0        (0x0u<<6)
#define TAMP_CR3_ITAMP7POM_B_0X1        (0x1u<<6)
#define TAMP_CR3_ITAMP6POM_B_0X0        (0x0u<<5)
#define TAMP_CR3_ITAMP6POM_B_0X1        (0x1u<<5)
#define TAMP_CR3_ITAMP5POM_B_0X0        (0x0u<<4)
#define TAMP_CR3_ITAMP5POM_B_0X1        (0x1u<<4)
#define TAMP_CR3_ITAMP4POM_B_0X0        (0x0u<<3)
#define TAMP_CR3_ITAMP4POM_B_0X1        (0x1u<<3)
#define TAMP_CR3_ITAMP3POM_B_0X0        (0x0u<<2)
#define TAMP_CR3_ITAMP3POM_B_0X1        (0x1u<<2)
#define TAMP_CR3_ITAMP2POM_B_0X0        (0x0u<<1)
#define TAMP_CR3_ITAMP2POM_B_0X1        (0x1u<<1)
#define TAMP_CR3_ITAMP1POM_B_0X0        (0x0u<<0)
#define TAMP_CR3_ITAMP1POM_B_0X1        (0x1u<<0)

// FLTCR Configuration

#define TAMP_FLTCR_TAMPPUDIS            (0x1u<<7)
#define TAMP_FLTCR_TAMPPRCH             (0x3u<<5)
#define TAMP_FLTCR_TAMPPRCH_0           (0x1u<<5)
#define TAMP_FLTCR_TAMPFLT              (0x3u<<3)
#define TAMP_FLTCR_TAMPFLT_0            (0x1u<<3)
#define TAMP_FLTCR_TAMPFREQ             (0x7u<<0)
#define TAMP_FLTCR_TAMPFREQ_0           (0x1u<<0)

#define TAMP_FLTCR_TAMPPUDIS_B_0X0      (0x0u<<7)
#define TAMP_FLTCR_TAMPPUDIS_B_0X1      (0x1u<<7)
#define TAMP_FLTCR_TAMPPRCH_B_0X0       (0x0u<<5)
#define TAMP_FLTCR_TAMPPRCH_B_0X1       (0x1u<<5)
#define TAMP_FLTCR_TAMPPRCH_B_0X2       (0x2u<<5)
#define TAMP_FLTCR_TAMPPRCH_B_0X3       (0x3u<<5)
#define TAMP_FLTCR_TAMPFLT_B_0X0        (0x0u<<3)
#define TAMP_FLTCR_TAMPFLT_B_0X1        (0x1u<<3)
#define TAMP_FLTCR_TAMPFLT_B_0X2        (0x2u<<3)
#define TAMP_FLTCR_TAMPFLT_B_0X3        (0x3u<<3)
#define TAMP_FLTCR_TAMPFREQ_B_0X0       (0x0u<<0)
#define TAMP_FLTCR_TAMPFREQ_B_0X1       (0x1u<<0)
#define TAMP_FLTCR_TAMPFREQ_B_0X2       (0x2u<<0)
#define TAMP_FLTCR_TAMPFREQ_B_0X3       (0x3u<<0)
#define TAMP_FLTCR_TAMPFREQ_B_0X4       (0x4u<<0)
#define TAMP_FLTCR_TAMPFREQ_B_0X5       (0x5u<<0)
#define TAMP_FLTCR_TAMPFREQ_B_0X6       (0x6u<<0)
#define TAMP_FLTCR_TAMPFREQ_B_0X7       (0x7u<<0)

// ATCR1 Configuration

#define TAMP_ATCR1_FLTEN                (0x1u<<31)
#define TAMP_ATCR1_ATOSHARE             (0x1u<<30)
#define TAMP_ATCR1_ATPER                (0x7u<<24)
#define TAMP_ATCR1_ATPER_0              (0x1u<<24)
#define TAMP_ATCR1_ATCKSEL              (0xFu<<16)
#define TAMP_ATCR1_ATCKSEL_0            (0x1u<<16)
#define TAMP_ATCR1_TAMP8AM              (0x1u<<7)
#define TAMP_ATCR1_TAMP7AM              (0x1u<<6)
#define TAMP_ATCR1_TAMP6AM              (0x1u<<5)
#define TAMP_ATCR1_TAMP5AM              (0x1u<<4)
#define TAMP_ATCR1_TAMP4AM              (0x1u<<3)
#define TAMP_ATCR1_TAMP3AM              (0x1u<<2)
#define TAMP_ATCR1_TAMP2AM              (0x1u<<1)
#define TAMP_ATCR1_TAMP1AM              (0x1u<<0)

#define TAMP_ATCR1_FLTEN_B_0X0          (0x0u<<31)
#define TAMP_ATCR1_FLTEN_B_0X1          (0x1u<<31)
#define TAMP_ATCR1_ATOSHARE_B_0X0       (0x0u<<30)
#define TAMP_ATCR1_ATOSHARE_B_0X1       (0x1u<<30)
#define TAMP_ATCR1_TAMP8AM_B_0X0        (0x0u<<7)
#define TAMP_ATCR1_TAMP8AM_B_0X1        (0x1u<<7)
#define TAMP_ATCR1_TAMP7AM_B_0X0        (0x0u<<6)
#define TAMP_ATCR1_TAMP7AM_B_0X1        (0x1u<<6)
#define TAMP_ATCR1_TAMP6AM_B_0X0        (0x0u<<5)
#define TAMP_ATCR1_TAMP6AM_B_0X1        (0x1u<<5)
#define TAMP_ATCR1_TAMP5AM_B_0X0        (0x0u<<4)
#define TAMP_ATCR1_TAMP5AM_B_0X1        (0x1u<<4)
#define TAMP_ATCR1_TAMP4AM_B_0X0        (0x0u<<3)
#define TAMP_ATCR1_TAMP4AM_B_0X1        (0x1u<<3)
#define TAMP_ATCR1_TAMP3AM_B_0X0        (0x0u<<2)
#define TAMP_ATCR1_TAMP3AM_B_0X1        (0x1u<<2)
#define TAMP_ATCR1_TAMP2AM_B_0X0        (0x0u<<1)
#define TAMP_ATCR1_TAMP2AM_B_0X1        (0x1u<<1)
#define TAMP_ATCR1_TAMP1AM_B_0X0        (0x0u<<0)
#define TAMP_ATCR1_TAMP1AM_B_0X1        (0x1u<<0)

// ATSEEDR Configuration

#define TAMP_ATSEEDR_SEED               (0xFFFFFFFFu<<0)
#define TAMP_ATSEEDR_SEED_0             (0x1u<<0)

// ATOR Configuration

