Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_tamp.h
#define TAMP_ATOR_INITS                 (0x1u<<15)
#define TAMP_ATOR_SEEDF                 (0x1u<<14)
#define TAMP_ATOR_PRNG                  (0xFFu<<0)
#define TAMP_ATOR_PRNG_0                (0x1u<<0)

// ATCR2 Configuration

#define TAMP_ATCR2_ATOSEL8              (0x7u<<29)
#define TAMP_ATCR2_ATOSEL8_0            (0x1u<<29)
#define TAMP_ATCR2_ATOSEL7              (0x7u<<26)
#define TAMP_ATCR2_ATOSEL7_0            (0x1u<<26)
#define TAMP_ATCR2_ATOSEL6              (0x7u<<23)
#define TAMP_ATCR2_ATOSEL6_0            (0x1u<<23)
#define TAMP_ATCR2_ATOSEL5              (0x7u<<20)
#define TAMP_ATCR2_ATOSEL5_0            (0x1u<<20)
#define TAMP_ATCR2_ATOSEL4              (0x7u<<17)
#define TAMP_ATCR2_ATOSEL4_0            (0x1u<<17)
#define TAMP_ATCR2_ATOSEL3              (0x7u<<14)
#define TAMP_ATCR2_ATOSEL3_0            (0x1u<<14)
#define TAMP_ATCR2_ATOSEL2              (0x7u<<11)
#define TAMP_ATCR2_ATOSEL2_0            (0x1u<<11)
#define TAMP_ATCR2_ATOSEL1              (0x7u<<8)
#define TAMP_ATCR2_ATOSEL1_0            (0x1u<<8)

#define TAMP_ATCR2_ATOSEL8_B_0X0        (0x0u<<29)
#define TAMP_ATCR2_ATOSEL8_B_0X1        (0x1u<<29)
#define TAMP_ATCR2_ATOSEL8_B_0X2        (0x2u<<29)
#define TAMP_ATCR2_ATOSEL8_B_0X3        (0x3u<<29)
#define TAMP_ATCR2_ATOSEL8_B_0X4        (0x4u<<29)
#define TAMP_ATCR2_ATOSEL8_B_0X5        (0x5u<<29)
#define TAMP_ATCR2_ATOSEL8_B_0X6        (0x6u<<29)
#define TAMP_ATCR2_ATOSEL8_B_0X7        (0x7u<<29)
#define TAMP_ATCR2_ATOSEL7_B_0X0        (0x0u<<26)
#define TAMP_ATCR2_ATOSEL7_B_0X1        (0x1u<<26)
#define TAMP_ATCR2_ATOSEL7_B_0X2        (0x2u<<26)
#define TAMP_ATCR2_ATOSEL7_B_0X3        (0x3u<<26)
#define TAMP_ATCR2_ATOSEL7_B_0X4        (0x4u<<26)
#define TAMP_ATCR2_ATOSEL7_B_0X5        (0x5u<<26)
#define TAMP_ATCR2_ATOSEL7_B_0X6        (0x6u<<26)
#define TAMP_ATCR2_ATOSEL7_B_0X7        (0x7u<<26)
#define TAMP_ATCR2_ATOSEL6_B_0X0        (0x0u<<23)
#define TAMP_ATCR2_ATOSEL6_B_0X1        (0x1u<<23)
#define TAMP_ATCR2_ATOSEL6_B_0X2        (0x2u<<23)
#define TAMP_ATCR2_ATOSEL6_B_0X3        (0x3u<<23)
#define TAMP_ATCR2_ATOSEL6_B_0X4        (0x4u<<23)
#define TAMP_ATCR2_ATOSEL6_B_0X5        (0x5u<<23)
#define TAMP_ATCR2_ATOSEL6_B_0X6        (0x6u<<23)
#define TAMP_ATCR2_ATOSEL6_B_0X7        (0x7u<<23)
#define TAMP_ATCR2_ATOSEL5_B_0X0        (0x0u<<20)
#define TAMP_ATCR2_ATOSEL5_B_0X1        (0x1u<<20)
#define TAMP_ATCR2_ATOSEL5_B_0X2        (0x2u<<20)
#define TAMP_ATCR2_ATOSEL5_B_0X3        (0x3u<<20)
#define TAMP_ATCR2_ATOSEL5_B_0X4        (0x4u<<20)
#define TAMP_ATCR2_ATOSEL5_B_0X5        (0x5u<<20)
#define TAMP_ATCR2_ATOSEL5_B_0X6        (0x6u<<20)
#define TAMP_ATCR2_ATOSEL5_B_0X7        (0x7u<<20)
#define TAMP_ATCR2_ATOSEL4_B_0X0        (0x0u<<17)
#define TAMP_ATCR2_ATOSEL4_B_0X1        (0x1u<<17)
#define TAMP_ATCR2_ATOSEL4_B_0X2        (0x2u<<17)
#define TAMP_ATCR2_ATOSEL4_B_0X3        (0x3u<<17)
#define TAMP_ATCR2_ATOSEL4_B_0X4        (0x4u<<17)
#define TAMP_ATCR2_ATOSEL4_B_0X5        (0x5u<<17)
#define TAMP_ATCR2_ATOSEL4_B_0X6        (0x6u<<17)
#define TAMP_ATCR2_ATOSEL4_B_0X7        (0x7u<<17)
#define TAMP_ATCR2_ATOSEL3_B_0X0        (0x0u<<14)
#define TAMP_ATCR2_ATOSEL3_B_0X1        (0x1u<<14)
#define TAMP_ATCR2_ATOSEL3_B_0X2        (0x2u<<14)
#define TAMP_ATCR2_ATOSEL3_B_0X3        (0x3u<<14)
#define TAMP_ATCR2_ATOSEL3_B_0X4        (0x4u<<14)
#define TAMP_ATCR2_ATOSEL3_B_0X5        (0x5u<<14)
#define TAMP_ATCR2_ATOSEL3_B_0X6        (0x6u<<14)
#define TAMP_ATCR2_ATOSEL3_B_0X7        (0x7u<<14)
#define TAMP_ATCR2_ATOSEL2_B_0X0        (0x0u<<11)
#define TAMP_ATCR2_ATOSEL2_B_0X1        (0x1u<<11)
#define TAMP_ATCR2_ATOSEL2_B_0X2        (0x2u<<11)
#define TAMP_ATCR2_ATOSEL2_B_0X3        (0x3u<<11)
#define TAMP_ATCR2_ATOSEL2_B_0X4        (0x4u<<11)
#define TAMP_ATCR2_ATOSEL2_B_0X5        (0x5u<<11)
#define TAMP_ATCR2_ATOSEL2_B_0X6        (0x6u<<11)
#define TAMP_ATCR2_ATOSEL2_B_0X7        (0x7u<<11)
#define TAMP_ATCR2_ATOSEL1_B_0X0        (0x0u<<8)
#define TAMP_ATCR2_ATOSEL1_B_0X1        (0x1u<<8)
#define TAMP_ATCR2_ATOSEL1_B_0X2        (0x2u<<8)
#define TAMP_ATCR2_ATOSEL1_B_0X3        (0x3u<<8)
#define TAMP_ATCR2_ATOSEL1_B_0X4        (0x4u<<8)
#define TAMP_ATCR2_ATOSEL1_B_0X5        (0x5u<<8)
#define TAMP_ATCR2_ATOSEL1_B_0X6        (0x6u<<8)
#define TAMP_ATCR2_ATOSEL1_B_0X7        (0x7u<<8)

// SECCFGR Configuration

#define TAMP_SECCFGR_TAMPSEC            (0x1u<<31)
#define TAMP_SECCFGR_BHKLOCK            (0x1u<<30)
#define TAMP_SECCFGR_BKPWSEC            (0xFFu<<16)
#define TAMP_SECCFGR_BKPWSEC_0          (0x1u<<16)
#define TAMP_SECCFGR_CNT1SEC            (0x1u<<15)
#define TAMP_SECCFGR_BKPRWSEC           (0xFFu<<0)
#define TAMP_SECCFGR_BKPRWSEC_0         (0x1u<<0)

#define TAMP_SECCFGR_TAMPSEC_B_0X0      (0x0u<<31)
#define TAMP_SECCFGR_TAMPSEC_B_0X1      (0x1u<<31)
#define TAMP_SECCFGR_BHKLOCK_B_0X0      (0x0u<<30)
#define TAMP_SECCFGR_BHKLOCK_B_0X1      (0x1u<<30)
#define TAMP_SECCFGR_CNT1SEC_B_0X0      (0x0u<<15)
#define TAMP_SECCFGR_CNT1SEC_B_0X1      (0x1u<<15)

// PRIVCFGR Configuration

#define TAMP_PRIVCFGR_TAMPPRIV          (0x1u<<31)
#define TAMP_PRIVCFGR_BKPWPRIV          (0x1u<<30)
#define TAMP_PRIVCFGR_BKPRWPRIV         (0x1u<<29)
#define TAMP_PRIVCFGR_CNT1PRIV          (0x1u<<15)

#define TAMP_PRIVCFGR_TAMPPRIV_B_0X0    (0x0u<<31)
#define TAMP_PRIVCFGR_TAMPPRIV_B_0X1    (0x1u<<31)
#define TAMP_PRIVCFGR_BKPWPRIV_B_0X0    (0x0u<<30)
#define TAMP_PRIVCFGR_BKPWPRIV_B_0X1    (0x1u<<30)
#define TAMP_PRIVCFGR_BKPRWPRIV_B_0X0   (0x0u<<29)
#define TAMP_PRIVCFGR_BKPRWPRIV_B_0X1   (0x1u<<29)
#define TAMP_PRIVCFGR_CNT1PRIV_B_0X0    (0x0u<<15)
#define TAMP_PRIVCFGR_CNT1PRIV_B_0X1    (0x1u<<15)

// IER Configuration

#define TAMP_IER_ITAMP15IE              (0x1u<<30)
#define TAMP_IER_ITAMP13IE              (0x1u<<28)
#define TAMP_IER_ITAMP12IE              (0x1u<<27)
#define TAMP_IER_ITAMP11IE              (0x1u<<26)
#define TAMP_IER_ITAMP9IE               (0x1u<<24)
#define TAMP_IER_ITAMP8IE               (0x1u<<23)
#define TAMP_IER_ITAMP7IE               (0x1u<<22)
#define TAMP_IER_ITAMP6IE               (0x1u<<21)
#define TAMP_IER_ITAMP5IE               (0x1u<<20)
#define TAMP_IER_ITAMP4IE               (0x1u<<19)
#define TAMP_IER_ITAMP3IE               (0x1u<<18)
#define TAMP_IER_ITAMP2IE               (0x1u<<17)
#define TAMP_IER_ITAMP1IE               (0x1u<<16)
#define TAMP_IER_TAMP8IE                (0x1u<<7)
#define TAMP_IER_TAMP7IE                (0x1u<<6)
#define TAMP_IER_TAMP6IE                (0x1u<<5)
#define TAMP_IER_TAMP5IE                (0x1u<<4)
#define TAMP_IER_TAMP4IE                (0x1u<<3)
#define TAMP_IER_TAMP3IE                (0x1u<<2)
#define TAMP_IER_TAMP2IE                (0x1u<<1)
#define TAMP_IER_TAMP1IE                (0x1u<<0)

#define TAMP_IER_ITAMP15IE_B_0X0        (0x0u<<30)
#define TAMP_IER_ITAMP15IE_B_0X1        (0x1u<<30)
#define TAMP_IER_ITAMP13IE_B_0X0        (0x0u<<28)
#define TAMP_IER_ITAMP13IE_B_0X1        (0x1u<<28)
#define TAMP_IER_ITAMP12IE_B_0X0        (0x0u<<27)
#define TAMP_IER_ITAMP12IE_B_0X1        (0x1u<<27)
#define TAMP_IER_ITAMP11IE_B_0X0        (0x0u<<26)
#define TAMP_IER_ITAMP11IE_B_0X1        (0x1u<<26)
#define TAMP_IER_ITAMP9IE_B_0X0         (0x0u<<24)
#define TAMP_IER_ITAMP9IE_B_0X1         (0x1u<<24)
#define TAMP_IER_ITAMP8IE_B_0X0         (0x0u<<23)
#define TAMP_IER_ITAMP8IE_B_0X1         (0x1u<<23)
#define TAMP_IER_ITAMP7IE_B_0X0         (0x0u<<22)
#define TAMP_IER_ITAMP7IE_B_0X1         (0x1u<<22)
#define TAMP_IER_ITAMP6IE_B_0X0         (0x0u<<21)
#define TAMP_IER_ITAMP6IE_B_0X1         (0x1u<<21)
#define TAMP_IER_ITAMP5IE_B_0X0         (0x0u<<20)
#define TAMP_IER_ITAMP5IE_B_0X1         (0x1u<<20)
#define TAMP_IER_ITAMP4IE_B_0X0         (0x0u<<19)
#define TAMP_IER_ITAMP4IE_B_0X1         (0x1u<<19)
#define TAMP_IER_ITAMP3IE_B_0X0         (0x0u<<18)
#define TAMP_IER_ITAMP3IE_B_0X1         (0x1u<<18)
#define TAMP_IER_ITAMP2IE_B_0X0         (0x0u<<17)
#define TAMP_IER_ITAMP2IE_B_0X1         (0x1u<<17)
#define TAMP_IER_ITAMP1IE_B_0X0         (0x0u<<16)
#define TAMP_IER_ITAMP1IE_B_0X1         (0x1u<<16)
#define TAMP_IER_TAMP8IE_B_0X0          (0x0u<<7)
#define TAMP_IER_TAMP8IE_B_0X1          (0x1u<<7)
#define TAMP_IER_TAMP7IE_B_0X0          (0x0u<<6)
#define TAMP_IER_TAMP7IE_B_0X1          (0x1u<<6)
#define TAMP_IER_TAMP6IE_B_0X0          (0x0u<<5)
#define TAMP_IER_TAMP6IE_B_0X1          (0x1u<<5)
#define TAMP_IER_TAMP5IE_B_0X0          (0x0u<<4)
#define TAMP_IER_TAMP5IE_B_0X1          (0x1u<<4)
#define TAMP_IER_TAMP4IE_B_0X0          (0x0u<<3)
#define TAMP_IER_TAMP4IE_B_0X1          (0x1u<<3)
#define TAMP_IER_TAMP3IE_B_0X0          (0x0u<<2)
#define TAMP_IER_TAMP3IE_B_0X1          (0x1u<<2)
#define TAMP_IER_TAMP2IE_B_0X0          (0x0u<<1)
#define TAMP_IER_TAMP2IE_B_0X1          (0x1u<<1)
#define TAMP_IER_TAMP1IE_B_0X0          (0x0u<<0)
#define TAMP_IER_TAMP1IE_B_0X1          (0x1u<<0)

// SR Configuration

#define TAMP_SR_ITAMP15F                (0x1u<<30)
#define TAMP_SR_ITAMP13F                (0x1u<<28)
#define TAMP_SR_ITAMP12F                (0x1u<<27)
#define TAMP_SR_ITAMP11F                (0x1u<<26)
#define TAMP_SR_ITAMP9F                 (0x1u<<24)
#define TAMP_SR_ITAMP8F                 (0x1u<<23)
#define TAMP_SR_ITAMP7F                 (0x1u<<22)
#define TAMP_SR_ITAMP6F                 (0x1u<<21)
#define TAMP_SR_ITAMP5F                 (0x1u<<20)
#define TAMP_SR_ITAMP4F                 (0x1u<<19)
#define TAMP_SR_ITAMP3F                 (0x1u<<18)
#define TAMP_SR_ITAMP2F                 (0x1u<<17)
#define TAMP_SR_ITAMP1F                 (0x1u<<16)
#define TAMP_SR_TAMP8F                  (0x1u<<7)
#define TAMP_SR_TAMP7F                  (0x1u<<6)
#define TAMP_SR_TAMP6F                  (0x1u<<5)
#define TAMP_SR_TAMP5F                  (0x1u<<4)
#define TAMP_SR_TAMP4F                  (0x1u<<3)
#define TAMP_SR_TAMP3F                  (0x1u<<2)
#define TAMP_SR_TAMP2F                  (0x1u<<1)
#define TAMP_SR_TAMP1F                  (0x1u<<0)

