Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_tamp.h
// MISR Configuration

#define TAMP_MISR_ITAMP15MF             (0x1u<<30)
#define TAMP_MISR_ITAMP13MF             (0x1u<<28)
#define TAMP_MISR_ITAMP12MF             (0x1u<<27)
#define TAMP_MISR_ITAMP11MF             (0x1u<<26)
#define TAMP_MISR_ITAMP9MF              (0x1u<<24)
#define TAMP_MISR_ITAMP8MF              (0x1u<<23)
#define TAMP_MISR_ITAMP7MF              (0x1u<<22)
#define TAMP_MISR_ITAMP6MF              (0x1u<<21)
#define TAMP_MISR_ITAMP5MF              (0x1u<<20)
#define TAMP_MISR_ITAMP4MF              (0x1u<<19)
#define TAMP_MISR_ITAMP3MF              (0x1u<<18)
#define TAMP_MISR_ITAMP2MF              (0x1u<<17)
#define TAMP_MISR_ITAMP1MF              (0x1u<<16)
#define TAMP_MISR_TAMP8MF               (0x1u<<7)
#define TAMP_MISR_TAMP7MF               (0x1u<<6)
#define TAMP_MISR_TAMP6MF               (0x1u<<5)
#define TAMP_MISR_TAMP5MF               (0x1u<<4)
#define TAMP_MISR_TAMP4MF               (0x1u<<3)
#define TAMP_MISR_TAMP3MF               (0x1u<<2)
#define TAMP_MISR_TAMP2MF               (0x1u<<1)
#define TAMP_MISR_TAMP1MF               (0x1u<<0)

// SMISR Configuration

#define TAMP_SMISR_ITAMP15MF            (0x1u<<30)
#define TAMP_SMISR_ITAMP13MF            (0x1u<<28)
#define TAMP_SMISR_ITAMP12MF            (0x1u<<27)
#define TAMP_SMISR_ITAMP11MF            (0x1u<<26)
#define TAMP_SMISR_ITAMP9MF             (0x1u<<24)
#define TAMP_SMISR_ITAMP8MF             (0x1u<<23)
#define TAMP_SMISR_ITAMP7MF             (0x1u<<22)
#define TAMP_SMISR_ITAMP6MF             (0x1u<<21)
#define TAMP_SMISR_ITAMP5MF             (0x1u<<20)
#define TAMP_SMISR_ITAMP4MF             (0x1u<<19)
#define TAMP_SMISR_ITAMP3MF             (0x1u<<18)
#define TAMP_SMISR_ITAMP2MF             (0x1u<<17)
#define TAMP_SMISR_ITAMP1MF             (0x1u<<16)
#define TAMP_SMISR_TAMP8MF              (0x1u<<7)
#define TAMP_SMISR_TAMP7MF              (0x1u<<6)
#define TAMP_SMISR_TAMP6MF              (0x1u<<5)
#define TAMP_SMISR_TAMP5MF              (0x1u<<4)
#define TAMP_SMISR_TAMP4MF              (0x1u<<3)
#define TAMP_SMISR_TAMP3MF              (0x1u<<2)
#define TAMP_SMISR_TAMP2MF              (0x1u<<1)
#define TAMP_SMISR_TAMP1MF              (0x1u<<0)

// SCR Configuration

#define TAMP_SCR_CITAMP15F              (0x1u<<30)
#define TAMP_SCR_CITAMP13F              (0x1u<<28)
#define TAMP_SCR_CITAMP12F              (0x1u<<27)
#define TAMP_SCR_CITAMP11F              (0x1u<<26)
#define TAMP_SCR_CITAMP9F               (0x1u<<24)
#define TAMP_SCR_CITAMP8F               (0x1u<<23)
#define TAMP_SCR_CITAMP7F               (0x1u<<22)
#define TAMP_SCR_CITAMP6F               (0x1u<<21)
#define TAMP_SCR_CITAMP5F               (0x1u<<20)
#define TAMP_SCR_CITAMP4F               (0x1u<<19)
#define TAMP_SCR_CITAMP3F               (0x1u<<18)
#define TAMP_SCR_CITAMP2F               (0x1u<<17)
#define TAMP_SCR_CITAMP1F               (0x1u<<16)
#define TAMP_SCR_CTAMP8F                (0x1u<<7)
#define TAMP_SCR_CTAMP7F                (0x1u<<6)
#define TAMP_SCR_CTAMP6F                (0x1u<<5)
#define TAMP_SCR_CTAMP5F                (0x1u<<4)
#define TAMP_SCR_CTAMP4F                (0x1u<<3)
#define TAMP_SCR_CTAMP3F                (0x1u<<2)
#define TAMP_SCR_CTAMP2F                (0x1u<<1)
#define TAMP_SCR_CTAMP1F                (0x1u<<0)

// COUNT1R Configuration

#define TAMP_COUNT1R_COUNT              (0xFFFFFFFFu<<0)
#define TAMP_COUNT1R_COUNT_0            (0x1u<<0)

// RPCFGR Configuration

#define TAMP_RPCFGR_RPCFG31             (0x1u<<31)
#define TAMP_RPCFGR_RPCFG7              (0x1u<<7)
#define TAMP_RPCFGR_RPCFG5              (0x1u<<5)
#define TAMP_RPCFGR_RPCFG4              (0x1u<<4)
#define TAMP_RPCFGR_RPCFG2              (0x1u<<2)
#define TAMP_RPCFGR_RPCFG1              (0x1u<<1)
#define TAMP_RPCFGR_RPCFG0              (0x1u<<0)

#define TAMP_RPCFGR_RPCFG31_B_0X0       (0x0u<<31)
#define TAMP_RPCFGR_RPCFG31_B_0X1       (0x1u<<31)
#define TAMP_RPCFGR_RPCFG7_B_0X0        (0x0u<<7)
#define TAMP_RPCFGR_RPCFG7_B_0X1        (0x1u<<7)
#define TAMP_RPCFGR_RPCFG5_B_0X0        (0x0u<<5)
#define TAMP_RPCFGR_RPCFG5_B_0X1        (0x1u<<5)
#define TAMP_RPCFGR_RPCFG4_B_0X0        (0x0u<<4)
#define TAMP_RPCFGR_RPCFG4_B_0X1        (0x1u<<4)
#define TAMP_RPCFGR_RPCFG2_B_0X0        (0x0u<<2)
#define TAMP_RPCFGR_RPCFG2_B_0X1        (0x1u<<2)
#define TAMP_RPCFGR_RPCFG1_B_0X0        (0x0u<<1)
#define TAMP_RPCFGR_RPCFG1_B_0X1        (0x1u<<1)
#define TAMP_RPCFGR_RPCFG0_B_0X0        (0x0u<<0)
#define TAMP_RPCFGR_RPCFG0_B_0X1        (0x1u<<0)

// BKP0R Configuration

#define TAMP_BKP0R_BKP                  (0xFFFFFFFFu<<0)
#define TAMP_BKP0R_BKP_0                (0x1u<<0)

// BKP1R Configuration

#define TAMP_BKP1R_BKP                  (0xFFFFFFFFu<<0)
#define TAMP_BKP1R_BKP_0                (0x1u<<0)

// BKP2R Configuration

#define TAMP_BKP2R_BKP                  (0xFFFFFFFFu<<0)
#define TAMP_BKP2R_BKP_0                (0x1u<<0)

// BKP3R Configuration

#define TAMP_BKP3R_BKP                  (0xFFFFFFFFu<<0)
#define TAMP_BKP3R_BKP_0                (0x1u<<0)

// BKP4R Configuration

#define TAMP_BKP4R_BKP                  (0xFFFFFFFFu<<0)
#define TAMP_BKP4R_BKP_0                (0x1u<<0)

// BKP5R Configuration

#define TAMP_BKP5R_BKP                  (0xFFFFFFFFu<<0)
#define TAMP_BKP5R_BKP_0                (0x1u<<0)

// BKP6R Configuration

#define TAMP_BKP6R_BKP                  (0xFFFFFFFFu<<0)
#define TAMP_BKP6R_BKP_0                (0x1u<<0)

// BKP7R Configuration

#define TAMP_BKP7R_BKP                  (0xFFFFFFFFu<<0)
#define TAMP_BKP7R_BKP_0                (0x1u<<0)

// BKP8R Configuration

#define TAMP_BKP8R_BKP                  (0xFFFFFFFFu<<0)
#define TAMP_BKP8R_BKP_0                (0x1u<<0)

// BKP9R Configuration

#define TAMP_BKP9R_BKP                  (0xFFFFFFFFu<<0)
#define TAMP_BKP9R_BKP_0                (0x1u<<0)

// BKP10R Configuration

#define TAMP_BKP10R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP10R_BKP_0               (0x1u<<0)

// BKP11R Configuration

#define TAMP_BKP11R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP11R_BKP_0               (0x1u<<0)

// BKP12R Configuration

#define TAMP_BKP12R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP12R_BKP_0               (0x1u<<0)

// BKP13R Configuration

