Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_tamp.h
#define TAMP_BKP13R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP13R_BKP_0               (0x1u<<0)

// BKP14R Configuration

#define TAMP_BKP14R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP14R_BKP_0               (0x1u<<0)

// BKP15R Configuration

#define TAMP_BKP15R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP15R_BKP_0               (0x1u<<0)

// BKP16R Configuration

#define TAMP_BKP16R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP16R_BKP_0               (0x1u<<0)

// BKP17R Configuration

#define TAMP_BKP17R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP17R_BKP_0               (0x1u<<0)

// BKP18R Configuration

#define TAMP_BKP18R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP18R_BKP_0               (0x1u<<0)

// BKP19R Configuration

#define TAMP_BKP19R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP19R_BKP_0               (0x1u<<0)

// BKP20R Configuration

#define TAMP_BKP20R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP20R_BKP_0               (0x1u<<0)

// BKP21R Configuration

#define TAMP_BKP21R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP21R_BKP_0               (0x1u<<0)

// BKP22R Configuration

#define TAMP_BKP22R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP22R_BKP_0               (0x1u<<0)

// BKP23R Configuration

#define TAMP_BKP23R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP23R_BKP_0               (0x1u<<0)

// BKP24R Configuration

#define TAMP_BKP24R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP24R_BKP_0               (0x1u<<0)

// BKP25R Configuration

#define TAMP_BKP25R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP25R_BKP_0               (0x1u<<0)

// BKP26R Configuration

#define TAMP_BKP26R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP26R_BKP_0               (0x1u<<0)

// BKP27R Configuration

#define TAMP_BKP27R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP27R_BKP_0               (0x1u<<0)

// BKP28R Configuration

#define TAMP_BKP28R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP28R_BKP_0               (0x1u<<0)

// BKP29R Configuration

#define TAMP_BKP29R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP29R_BKP_0               (0x1u<<0)

// BKP30R Configuration

#define TAMP_BKP30R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP30R_BKP_0               (0x1u<<0)

// BKP31R Configuration

#define TAMP_BKP31R_BKP                 (0xFFFFFFFFu<<0)
#define TAMP_BKP31R_BKP_0               (0x1u<<0)
